{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "5611693f",
   "metadata": {},
   "outputs": [],
   "source": [
    "node_properties_query = \"\"\"\n",
    "CALL db.schema.nodeTypeProperties() \n",
    "YIELD nodeLabels, propertyName\n",
    "WITH nodeLabels[0] AS label, collect(propertyName) AS props\n",
    "RETURN {labels: label, properties: props} AS output\n",
    "\"\"\"\n",
    "\n",
    "rel_properties_query = \"\"\"\n",
    "CALL db.schema.relTypeProperties() \n",
    "YIELD relType, propertyName\n",
    "WITH relType, collect(propertyName) AS props\n",
    "RETURN {type: relType, properties: props} AS output\n",
    "\"\"\"\n",
    "\n",
    "rel_query = \"\"\"\n",
    "CALL db.schema.visualization() \n",
    "YIELD nodes, relationships\n",
    "UNWIND relationships AS rel\n",
    "WITH startNode(rel) AS source, endNode(rel) AS target, type(rel) AS relType\n",
    "RETURN {source: labels(source)[0], relationship: relType, target: labels(target)[0]} AS output\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a28d25ab",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from neo4j.exceptions import CypherSyntaxError\n",
    "from openai import OpenAI\n",
    "\n",
    "def schema_text(node_props, rel_props, rels):\n",
    "    return f\"\"\"\n",
    "  Đây là schema của cơ sở dữ liệu Neo4j.\n",
    "  Các thuộc tính của node bao gồm:\n",
    "  {node_props}\n",
    "  Các thuộc tính quan hệ (relationship) bao gồm:\n",
    "  {rel_props}\n",
    "  Hướng quan hệ từ source node đến target nodes như sau:\n",
    "  {rels}\n",
    "  Hãy đảm bảo tuân thủ đúng các loại quan hệ và hướng của chúng.\n",
    "  \"\"\"\n",
    "\n",
    "class Neo4jGeminiQuery:\n",
    "    def __init__(self, url, user, password, gemini_api_key):\n",
    "        self.driver = GraphDatabase.driver(url, auth=(user, password))\n",
    "        self.client = OpenAI(\n",
    "            base_url=\"https://openrouter.ai/api/v1\",\n",
    "            api_key=gemini_api_key\n",
    "        )\n",
    "        # construct schema\n",
    "        self.schema = self.generate_schema()\n",
    "\n",
    "\n",
    "    def generate_schema(self):\n",
    "        node_props = self.query_database(node_properties_query)\n",
    "        rel_props = self.query_database(rel_properties_query)\n",
    "        rels = self.query_database(rel_query)\n",
    "        return schema_text(node_props, rel_props, rels)\n",
    "\n",
    "    def refresh_schema(self):\n",
    "        self.schema = self.generate_schema()\n",
    "\n",
    "    def get_rewrite_message(self):\n",
    "        return f\"\"\"\n",
    "        Bạn là chuyên gia xử lý ngôn ngữ tự nhiên cho các câu hỏi truy vấn đến cơ sở dữ liệu đồ thị Neo4j.\n",
    "        Nhiệm vụ: Dựa vào câu hỏi dưới dạng ngôn ngữ tự nhiên cho người dùng, hãy viết lại câu hỏi thành câu truy vấn dưới dạng ngôn ngữ tự nhiên dựa theo schema được định nghĩa mà từ câu truy vấn đó có thể chuyển sang câu lệnh Cypher một cách chính xác.\n",
    "        Hướng dẫn các nguyên tắc:\n",
    "        - Câu truy vấn phải giữ đúng nội dung của câu hỏi, không được tự phát sinh làm thay đổi các thông tin về node và thuộc tính có trong câu hỏi.\n",
    "        - Trong câu truy vấn, tuyệt đối không được nhắc đến tên loại quan hệ (relationship type) cụ thể.\n",
    "        - Dựa vào schema, bạn phải sắp xếp lại trật tự trong câu truy vấn để tuân theo hướng của các quan hệ, sao cho source node xuất hiện trước target node.\n",
    "        - Đối với các thuộc tính dùng để định danh, hãy luôn sử dụng từ \"bằng\" kết hợp với giá trị tìm kiếm dưới dạng chữ (ví dụ: a, b, c), số (ví dụ: 1, 2, 3) hay chữ số La Mã (ví dụ: I, II, III), đồng thời giữ đúng tên của thuộc tính định danh đó.\n",
    "        - Đối với các thuộc tính văn bản mô tả, hãy luôn sử dụng từ \"chứa\" kết hợp với giá trị tìm kiếm.\n",
    "        Dưới đây là schema của cơ sở dữ liệu Neo4j:\n",
    "        {self.schema}\n",
    "        Quy tắc đầu ra:\n",
    "        - Chỉ trả về duy nhất câu truy vấn hợp lệ dưới dạng ngôn ngữ tự nhiên.\n",
    "        - Tuyệt đối không thêm bất kỳ văn bản chào hỏi, giải thích, lưu ý hay phân tích nào khác.\n",
    "        \"\"\"\n",
    "\n",
    "    def rewrite_question(self, question):\n",
    "        messages = [\n",
    "            {\"role\": \"system\", \"content\": self.get_rewrite_message()},\n",
    "            {\"role\": \"user\", \"content\": question},\n",
    "        ]\n",
    "\n",
    "        completions = self.client.chat.completions.create(\n",
    "            model=\"google/gemini-2.5-flash\",\n",
    "            temperature=0.0,\n",
    "            # max_tokens=1000,\n",
    "            messages=messages\n",
    "        )\n",
    "        return completions.choices[0].message.content\n",
    "\n",
    "    def get_system_message(self):\n",
    "        return f\"\"\"\n",
    "        Bạn là chuyên gia viết các câu truy vấn Cypher cho cơ sở dữ liệu đồ thị Neo4j, đóng vai trò tiếp nhận câu hỏi dưới dạng ngôn ngữ tự nhiên và tạo câu lệnh Cypher tương ứng với câu hỏi đó (Text-to-Cypher).\n",
    "        Nhiệm vụ: Tạo câu lệnh Cypher để truy vấn cơ sở dữ liệu đồ thị Neo4j dựa trên định nghĩa schema được cung cấp.\n",
    "        Hướng dẫn các nguyên tắc:\n",
    "        - Phải sử dụng mối quan hệ có độ dài biến đổi (ví dụ: (A)-[*1..]->(B)) nếu xuất hiện bất kỳ đường đi hợp lệ nào có thể kết nối từ source node đến target node theo định nghĩa trong schema. Bạn tuyệt đối không được sử dụng bất kỳ loại quan hệ (relationship type) cụ thể nào ở mệnh đề MATCH.\n",
    "        - Theo mặc định, không thêm bất kỳ node trung gian nào vào đường đi kết nối các node trong mệnh đề MATCH nếu node trung gian đó không có trên câu hỏi. Tuy nhiên, nếu câu hỏi của người dùng có yêu cầu sử dụng các thuộc tính của node trung gian để lọc hay trả về thì đến lúc đó bạn phải khai báo rõ ràng node trung gian đó ở đường đi trong mệnh để MATCH để áp dụng mệnh đề WHERE hay RETURN một cách chính xác.\n",
    "        - Tuyệt đối tuân thủ hướng của các mối quan hệ mà chỉ được định nghĩa ở trong schema. Bạn tuyệt đối không được đảo ngược hướng của quan hệ hay đảo target node lên vị trí của source node trong mệnh đề MATCH ở bất kỳ trường hợp nào.\n",
    "        - Đối với các thuộc tính dùng để định danh (ví dụ: number), hãy luôn sử dụng toán tử =, ngay cả khi giá trị tìm kiếm là chữ cái (ví dụ: a, b, c), số (ví dụ: 1, 2, 3) hay là chữ số La Mã (ví dụ: I, II, III).\n",
    "        - Đối với các thuộc tính văn bản mô tả (ví dụ: doc_name, title, content), hãy luôn sử dụng toán tử toán tử CONTAINS trong mệnh đề WHERE, đồng thời áp dụng hàm toLower() cho cả thuộc tính văn bản mô tả đó lẫn giá trị tìm kiếm trong mệnh đề WHERE.\n",
    "        - Không bao giờ trả về toàn bộ node object. Thay vào đó, ở mệnh để RETURN, chỉ chọn các thuộc tính có liên quan đến câu hỏi của người dùng có trong các node này.\n",
    "        - Nếu không thể tạo ra câu lệnh Cypher từ schema đã cung cấp, hãy giải thích lý do cho người dùng.\n",
    "        Dưới đây là schema của cơ sở dữ liệu đồ thị Neo4j:\n",
    "        {self.schema}\n",
    "        Quy tắc đầu ra:\n",
    "        - Chỉ trả về duy nhất câu lệnh Cypher hợp lệ và tuyệt đối không được bọc trong block code markdown (không dùng ```cypher ```).\n",
    "        - Tuyệt đối không thêm bất kỳ văn bản chào hỏi, giải thích, lưu ý hay phân tích nào khác.\n",
    "        - Trường hợp duy nhất được phép trả về văn bản mà không có Cypher query là khi không thể tạo được câu lệnh từ schema, lúc đó hãy đưa ra nguyên nhân trực tiếp.\n",
    "        Ví dụ:\n",
    "        Input: Ai là người ký Luật đường bộ?\n",
    "        Output: MATCH (d:Document)-[*1..]->(s:Signer) WHERE toLower(d.doc_name) CONTAINS toLower('Luật đường bộ') RETURN s.name\n",
    "        Input: Nghị định 168 có bao nhiêu điều?\n",
    "        Output: MATCH (d:Document)-[*1..]->(a:Article) WHERE toLower(d.doc_name) CONTAINS toLower('Nghị định 168') RETURN count(a)\n",
    "        Input: Văn bản nào có chứa quy định về việc tịch thu phương tiện?\n",
    "        Output: MATCH (d:Document)-[*1..]->(child) WHERE child:Section OR child:Part OR child:Chapter OR child:Article OR child:Clause OR child:Point WITH d, child WHERE toLower(child.title) CONTAINS \"tịch thu phương tiện\" OR toLower(child.content) CONTAINS \"tịch thu phương tiện\" RETURN DISTINCT d.doc_name\n",
    "\n",
    "        Lưu ý: Không bao gồm bất kỳ lời giải thích hay xin lỗi nào trong câu trả lời của bạn.\n",
    "        \"\"\"\n",
    "\n",
    "    def query_database(self, neo4j_query, params={}):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.run(neo4j_query, params)\n",
    "            output = [r.values() for r in result]\n",
    "            output.insert(0, result.keys())\n",
    "            return output\n",
    "\n",
    "    def construct_cypher(self, question, rewrite, history=None):\n",
    "        messages = [\n",
    "            {\"role\": \"system\", \"content\": self.get_system_message()},\n",
    "            {\"role\": \"user\", \"content\": f\"\"\"Câu hỏi gốc của người dùng: {question}.\n",
    "                                Câu truy vấn đã được viết lại: {rewrite}.\"\"\"},\n",
    "        ]\n",
    "        # Used for Cypher healing flows\n",
    "        if history:\n",
    "            messages.extend(history)\n",
    "\n",
    "        completions = self.client.chat.completions.create(\n",
    "            model=\"google/gemini-2.5-flash\",\n",
    "            temperature=0.0,\n",
    "            # max_tokens=1000,\n",
    "            messages=messages\n",
    "        )\n",
    "        return completions.choices[0].message.content\n",
    "\n",
    "    def run(self, question, history=None, retry=True):\n",
    "        # Construct Cypher statement\n",
    "        rewrite = self.rewrite_question(question)\n",
    "        print(rewrite)\n",
    "        cypher = self.construct_cypher(question, rewrite, history)\n",
    "        print(cypher)\n",
    "        try:\n",
    "            return self.query_database(cypher)\n",
    "        # Self-healing flow\n",
    "        except CypherSyntaxError as e:\n",
    "            # If out of retries\n",
    "            if not retry:\n",
    "              return \"Cú pháp Cypher không hợp lệ.\"\n",
    "        # Self-healing Cypher flow by\n",
    "        # providing specific error to Gemini\n",
    "            print(\"Đang thử lại\")\n",
    "            return self.run(\n",
    "                question,\n",
    "                [\n",
    "                    {\"role\": \"assistant\", \"content\": cypher},\n",
    "                    {\n",
    "                        \"role\": \"user\",\n",
    "                        \"content\": f\"\"\"Câu truy vấn này trả về lỗi sau: {str(e)} \n",
    "                        Hãy cung cấp cho tôi một câu truy vấn đã được cải thiện để chạy được mà không cần bất kỳ lời giải thích hay xin lỗi nào.\"\"\",\n",
    "                    },\n",
    "                ],\n",
    "                retry=False\n",
    "            )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "09637d10",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "api_key = os.environ.get(\"OPENROUTER_API_KEY\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "721385bb",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N62', status_description='warn: procedure or function execution warning. Execution of the procedure db.schema.nodeTypeProperties() generated the warning The field `propertyTypes` will change output format in the next major version.', position=<SummaryInputPosition line=2, column=1, offset=1>, raw_classification='GENERIC', classification=<NotificationClassification.GENERIC: 'GENERIC'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'GENERIC', '_severity': 'WARNING', '_position': {'offset': 1, 'line': 2, 'column': 1}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nCALL db.schema.nodeTypeProperties() \\nYIELD nodeLabels, propertyName\\nWITH nodeLabels[0] AS label, collect(propertyName) AS props\\nRETURN {labels: label, properties: props} AS output\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N62', status_description='warn: procedure or function execution warning. Execution of the procedure db.schema.relTypeProperties() generated the warning The field `propertyTypes` will change output format in the next major version.', position=<SummaryInputPosition line=2, column=1, offset=1>, raw_classification='GENERIC', classification=<NotificationClassification.GENERIC: 'GENERIC'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'GENERIC', '_severity': 'WARNING', '_position': {'offset': 1, 'line': 2, 'column': 1}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nCALL db.schema.relTypeProperties() \\nYIELD relType, propertyName\\nWITH relType, collect(propertyName) AS props\\nRETURN {type: relType, properties: props} AS output\\n'\n"
     ]
    }
   ],
   "source": [
    "gds_db = Neo4jGeminiQuery(\n",
    "    url=os.environ.get(\"NEO4J_URI\"),\n",
    "    user=os.environ.get(\"NEO4J_USER\"),\n",
    "    password=os.environ.get(\"NEO4J_PASSWORD\"),\n",
    "    gemini_api_key=api_key,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "031ff579",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tìm các Document được ký bởi Signer có tên bằng Trần Thanh Mẫn.\n",
      "MATCH (d:Document)-[:SIGNED_BY]->(s:Signer) WHERE toLower(s.name) CONTAINS toLower('Trần Thanh Mẫn') RETURN d.doc_name\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[['d.doc_name'],\n",
       " ['Luật Đường bộ của Quốc hội, số 35/2024/QH15'],\n",
       " ['Luật Trật tự, an toàn giao thông đường bộ của Quốc hội, số 36/2024/QH15'],\n",
       " ['Luật sửa đổi, bổ sung một số điều của Luật Xử lý vi phạm hành chính của Quốc hội, số 88/2025/QH15'],\n",
       " ['Luật sửa đổi, bổ sung một số điều của 10 Luật có liên quan đến an ninh, trật tự của Quốc hội, số 118/2025/QH15'],\n",
       " ['Luật sửa đổi, bổ sung một số điều của Luật Chứng khoán, Luật Kế toán, Luật Kiểm toán độc lập, Luật Ngân sách Nhà nước, Luật Quản lý, sử dụng tài sản công, Luật Quản lý thuế, Luật Thuế thu nhập cá nhân, Luật Dự trữ quốc gia, Luật Xử lý vi phạm hành chính của Quốc hội, số 56/2024/QH15']]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds_db.run(\"\"\"\n",
    "Trần Thanh Mẫn đã ký những văn bản nào?\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "00c05a81",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tìm các Document có Field có tên bằng 'Giao thông'.\n",
      "MATCH (d:Document)-[*1..]->(f:Field) WHERE toLower(f.name) CONTAINS toLower('Giao thông') RETURN d.doc_name\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[['d.doc_name'],\n",
       " ['Nghị định 119/2024/NĐ-CP của Chính phủ quy định về thanh toán điện tử giao thông đường bộ'],\n",
       " ['Luật Trật tự, an toàn giao thông đường bộ của Quốc hội, số 36/2024/QH15'],\n",
       " ['Luật Đường bộ của Quốc hội, số 35/2024/QH15'],\n",
       " ['Nghị định 123/2021/NĐ-CP của Chính phủ về việc sửa đổi, bổ sung một số điều của các Nghị định quy định xử phạt vi phạm hành chính trong lĩnh vực hàng hải; giao thông đường bộ, đường sắt; hàng không dân dụng'],\n",
       " ['Nghị định 100/2019/NĐ-CP của Chính phủ về việc quy định xử phạt vi phạm hành chính trong lĩnh vực giao thông đường bộ và đường sắt'],\n",
       " ['Nghị định 168/2024/NĐ-CP của Chính phủ quy định xử phạt vi phạm hành chính về trật tự, an toàn giao thông trong lĩnh vực giao thông đường bộ; trừ điểm, phục hồi điểm giấy phép lái xe']]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds_db.run(\"\"\"\n",
    "Liệt kê các văn bản thuộc lĩnh vực Giao thông?\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "0b0b4ee5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tìm các Document được ban hành bởi Organization có tên bằng \"Quốc hội\"\n",
      "MATCH (d:Document)-[:ISSUED_BY]->(o:Organization) WHERE toLower(o.name) CONTAINS toLower('Quốc hội') RETURN d.doc_name\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[['d.doc_name'],\n",
       " ['Luật sửa đổi, bổ sung một số điều của Luật Xử lý vi phạm hành chính của Quốc hội, số 67/2020/QH14'],\n",
       " ['Luật Phòng, chống tác hại của rượu, bia của Quốc hội, số 44/2019/QH14'],\n",
       " ['Luật Đường bộ của Quốc hội, số 35/2024/QH15'],\n",
       " ['Luật Trật tự, an toàn giao thông đường bộ của Quốc hội, số 36/2024/QH15'],\n",
       " ['Luật Xử lý vi phạm hành chính của Quốc hội, số 15/2012/QH13'],\n",
       " ['Luật sửa đổi, bổ sung một số điều của Luật Xử lý vi phạm hành chính của Quốc hội, số 88/2025/QH15'],\n",
       " ['Luật sửa đổi, bổ sung một số điều của 10 Luật có liên quan đến an ninh, trật tự của Quốc hội, số 118/2025/QH15'],\n",
       " ['Luật sửa đổi, bổ sung một số điều của Luật Chứng khoán, Luật Kế toán, Luật Kiểm toán độc lập, Luật Ngân sách Nhà nước, Luật Quản lý, sử dụng tài sản công, Luật Quản lý thuế, Luật Thuế thu nhập cá nhân, Luật Dự trữ quốc gia, Luật Xử lý vi phạm hành chính của Quốc hội, số 56/2024/QH15']]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds_db.run(\"\"\"\n",
    "Quốc hội ban hành những văn bản nào?\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "76474f68",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tìm số lượng Chapter của Document có doc_name chứa \"Nghị định 100\"\n",
      "MATCH (d:Document)-[*1..]->(c:Chapter) WHERE toLower(d.doc_name) CONTAINS toLower('Nghị định 100') RETURN count(c)\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[['count(c)'], [5]]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds_db.run(\"\"\"\n",
    "Có bao nhiêu chương trong Nghị định 100?\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "a650110c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Đếm\n",
      "MATCH (d:Document)-[*1..]->(a:Article) WHERE toLower(d.doc_name) CONTAINS toLower('Nghị định 100') RETURN count(a)\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[['count(a)'], [86]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds_db.run(\"\"\"\n",
    "Có bao nhiêu điều trong Nghị định 100?\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "20f0abe1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tìm các Article có parent_chapter là Chapter có number bằng \"I\" và doc_identity là Document có doc_name chứa \"Nghị định 168\", và trả về title của Article.\n",
      "MATCH (d:Document)-[*1..]->(c:Chapter)-[*1..]->(a:Article) WHERE toLower(d.doc_name) CONTAINS toLower('Nghị định 168') AND c.number = 'I' RETURN a.title\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[['a.title'],\n",
       " ['Tước quyền sử dụng giấy phép, chứng chỉ hành nghề có thời hạn'],\n",
       " ['Đối tượng áp dụng'],\n",
       " ['Thời hiệu xử phạt vi phạm hành chính; hành vi vi phạm hành chính đã kết thúc, hành vi vi phạm hành chính đang thực hiện'],\n",
       " ['Hình thức xử phạt vi phạm hành chính, biện pháp khắc phục hậu quả; thu hồi giấy phép, chứng chỉ hành nghề'],\n",
       " ['Phạm vi điều chỉnh']]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds_db.run(\"\"\"\n",
    "Liệt kê tiêu đề của tất cả các điều thuộc chương I trong Nghị định 168?\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "6bf01a0d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tìm số lượng Clause và số lượng Point của Article có doc_identity bằng \"Nghị định 168\" và number bằng \"1\"\n",
      "MATCH (d:Document)-[*1..]->(a:Article) WHERE toLower(d.doc_name) CONTAINS toLower('Nghị định 168') AND a.number = '1' OPTIONAL MATCH (a)-[:HAS_CLAUSE]->(c:Clause) OPTIONAL MATCH (a)-[:HAS_CLAUSE]->(c_with_points:Clause)-[:HAS_POINT]->(p:Point) RETURN count(DISTINCT c) AS ClauseCount, count(DISTINCT p) AS PointCount\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[['ClauseCount', 'PointCount'], [2, 2]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds_db.run(\"\"\"\n",
    "Trong Nghị định 168, điều 1 có tất cả bao nhiêu khoản và có tất cả bao nhiêu điểm?\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "bf850323",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tìm Khoản có số bằng \"2\" và thuộc về Điều có số bằng \"1\" và thuộc về Nghị định có doc_name chứa \"168\", sau đó trả về nội dung của Khoản đó.\n",
      "MATCH (d:Document)-[*1..]->(a:Article)-[*1..]->(c:Clause) WHERE toLower(d.doc_name) CONTAINS toLower('Nghị định 168') AND a.number = '1' AND c.number = '2' RETURN c.content\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[['c.content'],\n",
       " ['Các hành vi vi phạm hành chính trong lĩnh vực quản lý nhà nước khác liên quan đến trật tự, an toàn giao thông trong lĩnh vực giao thông đường bộ mà không quy định tại Nghị định này thì áp dụng quy định tại các Nghị định quy định về xử phạt vi phạm hành chính trong các lĩnh vực đó để xử phạt.']]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds_db.run(\"\"\"\n",
    "Cho biết nội dung của khoản 2 điều 1 nghị định 168?\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "2a1b1d29",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tìm Document có số lượng Article lớn nhất.\n",
      "MATCH (d:Document)-[*1..]->(a:Article) RETURN d.doc_name, count(a) AS ArticleCount ORDER BY ArticleCount DESC LIMIT 1\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[['d.doc_name', 'ArticleCount'],\n",
       " ['Luật Xử lý vi phạm hành chính của Quốc hội, số 15/2012/QH13', 142]]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds_db.run(\"\"\"\n",
    "Văn bản nào có nhiều Điều nhất trong hệ thống dữ liệu hiện tại?\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "d80c841c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tìm tất cả các Document có issue_date chứa \"2020\"\n",
      "MATCH (d:Document) WHERE toLower(d.issue_date) CONTAINS toLower(\"2020\") RETURN d.doc_name, d.issue_date\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[['d.doc_name', 'd.issue_date'],\n",
       " ['Luật sửa đổi, bổ sung một số điều của Luật Xử lý vi phạm hành chính của Quốc hội, số 67/2020/QH14',\n",
       "  '2020-11-13T00:00:00']]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds_db.run(\"\"\"\n",
    "Liệt kê tất cả các văn bản ban hành năm 2020?\n",
    "\"\"\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
